[
    {
        "tag": "FRONTEND",
        "content": "<h3>Présentation</h3><p>Mon portfolio est un site web qui me permet de présenter mes projets et compétences en développement et photographie. Il est construit avec React et Vite, et utilise TailwindCSS pour le style. Il est écrit en TypeScript et est déployé automatiquement sur <code>GitHub Pages</code> grâce à <code>GitHub Actions</code>.</p><p>L'application est une <code>SPA (Single Page Application)</code>. Elle est responsive et s'adapte à tous les écrans.</p><h3>Contexte</h3><p>Ce projet a été réalisé dans le cadre de mon développement personnel. Il me permet de présenter mes projets et compétences en développement et photographie. Il me permet également de mettre en pratique mes compétences en développement web, et de me concentrer particulièrement sur le design et l'expérience utilisateur.</p><h3>Fonctionnalités</h3><p>L'application présente les sections suivantes :</p><ul><li>Présentation de mes projets et compétences en développement et photographie</li><li>Affichage des projets et compétences par catégories</li><li>Affichage de mes compétences</li><li>Affichage de mon parcours</li><li>Affichage de mes coordonnées et section de contact</li></ul><h3>Développement</h3><h4>Installation</h4><blockquote>> Prérequis : Node.js</blockquote><pre><code class=\"language-bash\">git clone https://github.com/Eric-Philippe/portfolio.git\n\ncd portfolio\n\nnpm install\n\nnpm run dev</code></pre><h3>Évolution des compétences</h3><p>La création de mon portfolio a été une expérience enrichissante, mettant en avant le développement et l'intégration de compétences variées. Pour répondre à la compétence \"Choisir et implémenter les architectures adaptées\", j'ai fait un choix délibéré en optant pour React et Vite, des technologies modernes permettant une gestion efficace des composants et un chargement rapide. L'utilisation de TailwindCSS, illustrant la compétence \"Concevoir et développer des applications communicantes\", a permis de concevoir une interface claire et réactive, optimisant ainsi l'expérience utilisateur.</p><p>La mise en œuvre de GitHub Actions pour le déploiement automatique sur GitHub Pages a renforcé la compétence \"Intégrer des solutions dans un environnement de production\". Cette automatisation témoigne d'une gestion avancée du cycle de vie du développement logiciel. De plus, l'utilisation de TypeScript a permis de renforcer la sécurité du code, alignant le projet avec les exigences de \"Sécuriser les services et données d’un système\".</p><p>La nature responsive du site, adaptée à divers écrans, représente une évolution dans la compétence \"Anticiper les résultats de diverses métriques\", en prêtant attention à l'expérience utilisateur sur différentes plateformes. L'application sert également de vitrine pour mes compétences en photographie, élargissant ainsi le champ d'application à la compétence \"Choisir et utiliser des bibliothèques et méthodes dédiées au domaine d'application\".</p><p>En résumé, la création de mon portfolio a été l'occasion de consolider les compétences existantes tout en explorant de nouveaux domaines, reflétant une évolution significative dans ma maîtrise du développement web et de la présentation visuelle de projets.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/portfolio/main/res/head_portfolio.gif",
        "techs": [
            [
                "React"
            ],
            [
                "Vite"
            ],
            [
                "TailwindCSS"
            ],
            [
                "TypeScript"
            ],
            [
                "CI/CD"
            ],
            [
                "Python"
            ]
        ],
        "title": "Portfolio",
        "date": "Janvier 2024",
        "shortDesc": "Portfolio web mettant en valeur mes projets et compétences en développement et photographie. Découvrez mon parcours créatif.",
        "gitLink": "https://github.com/Eric-Philippe/portfolio"
    },
    {
        "tag": "FULLSTACK",
        "content": "<h3>Présentation</h3><p>Glitch and Books est un gestionnaire bibliothécaire en ligne. Il permet d'enregistrer des livres, de les trier, et de les explorer avec des statistiques. Il est construit avec <code>React</code> et <code>Bootstrap</code>, et utilise une base de données <code>PostgreSQL</code>. Il est écrit en <code>TypeScript</code> et est déployé automatiquement sur mon serveur Personnel grâce à <code>GitHub Actions</code>.</p><h3>Contexte</h3><p>Ce projet a été réalisé pour répondre aux besoins d'un proche qui n'était pas satisfait des solutions déjà existantes. Il permet de gérer une bibliothèque de livres, enregistrant les informations de base (titre, auteur, édition, etc.) ainsi que des informations plus détaillées (date de lecture, note, etc.). Il permet également de trier les livres par catégories, et d'explorer les statistiques de lecture.</p><img src=\"https://raw.githubusercontent.com/Eric-Philippe/GlitchAndBooks/main/img/stat-first.png\" alt=\"Stats\"><h3>Fonctionnalités</h3><p>L'application présente les sections suivantes :</p><ul><li>Système complet d'authentification et de gestion de compte</li><li>Enregistrement de livres avec informations de base et informations détaillées</li><li>Tri des livres par catégories</li><li>Affichage des statistiques de lecture</li><li>Affichage des livres enregistrés</li><li>Affichage des informations de compte</li></ul><blockquote>> Bientôt: Recommandations de livres et Wishlist</blockquote><h3>Accéder à l'application</h3><p>L'application est accessible à l'adresse suivante :</p><a href=\"https://glitchandbooks.fr\">https://glitchandbooks.fr</a><h3>Évolution des Compétences</h3><p>La conception et la réalisation de Glitch and Books ont représenté une étape significative dans le développement de mes compétences. En conformité avec la compétence \"Choisir et implémenter les architectures adaptées\", le choix de React et Bootstrap a permis de créer une interface utilisateur réactive et conviviale. L'utilisation de TypeScript a été essentielle pour garantir la robustesse du code, alignant le projet avec les normes de pour sécuriser les services et données d’un système.</p><p>L'intégration d'une base de données PostgreSQL et le déploiement automatique sur un serveur personnel via GitHub Actions démontrent une maîtrise croissante des compétences pour intégrer des solutions dans un environnement de production\". La gestion de l'authentification et des comptes, conforme aux compétences consistant à concevoir et développer des applications communicantes\", témoigne de la mise en pratique des compétences avancées en sécurité.</p><p>Dans le contexte du projet, la réponse aux besoins spécifiques d'un proche a mis en valeur des compétences pour formaliser les besoins du client et de l'utilisateur. La création d'une application complète, avec des fonctionnalités telles que l'enregistrement détaillé des livres, le tri par catégories, et les statistiques de lecture, illustre l'évolution dans le domaine pour profiler, analyser et justifier le comportement d’un code existant\" en assurant une gestion efficace et optimale du code.</p><p>Les prochaines fonctionnalités prévues, notamment les recommandations de livres et la wishlist, anticipent la satisfaction continue des besoins des utilisateurs, soulignant une compréhension avancée pour dentifier les critères de faisabilité d’un projet informatique et anticiper les résultats de diverses métriques.</p><p>En conclusion, Glitch and Books représente une réalisation majeure, marquée par l'évolution et l'application de compétences variées en développement web, gestion de bases de données et réponse proactive aux besoins des utilisateurs.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/GlitchAndBooks/main/img/browse.png",
        "techs": [
            [
                "React"
            ],
            [
                "Bootstrap"
            ],
            [
                "PostgreSQL"
            ],
            [
                "TypeScript"
            ],
            [
                "Express"
            ],
            [
                "CI/CD"
            ]
        ],
        "title": "Glitch and Books",
        "date": "Octobre 2023",
        "shortDesc": "Gestionnaire bibliothécaire en ligne. Enregistrez, triez, et explorez vos livres avec des statistiques et bientôt des recommandations.",
        "gitLink": "https://github.com/Eric-Philippe/GlitchAndBooks"
    },
    {
        "tag": "TOOL",
        "content": "<h3>Présentation</h3><p>\"JuliaMarkdownJoy\" est un outil versatile en codé en <code>Julia</code> permettant d'analyser des fichiers Markdown en <code>JSON</code>, d'extraire des champs spécifiques, et de convertir le tout en <code>HTML</code>. Il profite d'une intégration continue avec <code>GitHub Actions</code>, afin de garantir un déploiement <strong>rapide</strong> et <strong>fiable</strong>.</p><h3>Performance</h3><p>Julia Markdown Joy permet de parser plus de <code>100_000</code> fichiers markdown en <code>JSON</code> en moins de <code>3</code> secondes !</p><h3>Contexte</h3><p>Ce projet a été réalisé dans le cadre de mon développement de mon portfolio. Il me permet de générer des fichiers <code>JSON</code> à partir de fichiers <code>Markdown</code>, afin de les utiliser dans mon portfolio. Il me permet également de mettre en pratique mes compétences en développement et de me concentrer particulièrement sur <strong>l'automatisation</strong>.</p><h3>Fun Fact</h3><p>Vous consultez actuellement le rendu d'un fichier <code>Markdown</code> généré par <strong>\"JuliaMarkdownJoy\"</strong> !</p><h3>Fonctionnalités</h3><p>L'application présente les sections suivantes :</p><ul><li>Parser : Analyse des fichiers Markdown en JSON</li><li>Extractor : Extraction de champs spécifiques</li><li>Converter : Conversion en HTML</li></ul><h3>Développement</h3><blockquote>> Pourquoi Julia ?</blockquote><p>Julia est un langage de programmation dynamique, performant et polyvalent. Il est particulièrement adapté à la manipulation de données, et est utilisé dans de nombreux domaines, notamment la finance, la science et l'ingénierie. Il est également très apprécié pour son écosystème de packages, qui permettent d'étendre ses fonctionnalités.</p><h3>Utilisation</h3><pre><code class=\"language-bash\">> julia JuliaMarkdownJoy/src/run.jl extract -i _projects/ -c _projects/config.json  -o data.json\n\n🎉 10 Markdown files extracted successfully in data.json !</code></pre><h3>Évolution des compétences</h3><p>Le développement de \"JuliaMarkdownJoy\" représente une étape significative dans l'évolution de mes compétences, mettant en lumière plusieurs aspects du processus de développement logiciel.</p><p>La compétence \"Choisir et implémenter les architectures adaptées\" est démontrée par le choix judicieux d'utiliser Julia, un langage de programmation dynamique et polyvalent. Julia offre des performances exceptionnelles, ce qui est crucial pour des tâches exigeantes telles que l'analyse de fichiers Markdown. Ce choix s'aligne également avec la compétence \"Choisir et utiliser des bibliothèques et méthodes dédiées au domaine d'application\", montrant la pertinence de Julia dans le domaine de la manipulation de données.</p><p>La section \"Contexte\" souligne l'application concrète des compétences de concevoir et développer des applications communicantes. \"JuliaMarkdownJoy\" n'est pas seulement un outil isolé, mais une composante intégrée dans le développement de mon portfolio, illustrant une approche systémique du développement logiciel.</p><p>La fonctionnalité \"Parser\" met en œuvre la compétence profiler, analyser et justifier le comportement d’un code existant. L'analyse des fichiers Markdown en JSON nécessite une compréhension approfondie du fonctionnement interne du langage Julia et des mécanismes de manipulation de fichiers.</p><p>Enfin, le choix de Julia est expliqué dans la section \"Développement\". Cela va au-delà de la simple compétence technique pour montrer la pensée critique et la prise de décision en matière de langage de programmation, correspondant identifier les critères de faisabilité d’un projet informatique.</p>",
        "previewImg": "https://media.discordapp.net/attachments/579303130886569984/1196458574566654022/image.png?ex=65b7b3e1&is=65a53ee1&hm=bad4b2530611e221a4d55c9c8657818f055f17f6ca088b79a826aa925ee212c9&=&format=webp&quality=lossless&width=1282&height=662",
        "techs": [
            [
                "Julia"
            ],
            [
                "Markdown"
            ],
            [
                "CI/CD"
            ],
            [
                "Git"
            ],
            [
                "Python"
            ]
        ],
        "title": "Julia Markdown Joy",
        "date": "Janvier 2024",
        "shortDesc": "\"JuliaMarkdownJoy\" - Outil versatile en Julia pour analyser des fichiers Markdown en JSON, extraire des champs spécifiques, et convertir le tout en HTML",
        "gitLink": "https://github.com/Eric-Philippe/JuliaMarkdownJoy"
    },
    {
        "tag": "CHALLENGE",
        "content": "<h3>Présentation</h3><p>Advent of Code est un <strong>challenge</strong> de programmation qui a lieu chaque année en décembre. Chaque jour, un nouveau problème est proposé. Afin de rajouter du défi, j'ai décidé de résoudre chaque problème pour l'année 2022 avec un langage différent. J'ai donc eu l'occasion d'utiliser des langages très communs comme <code>Java</code>, <code>Python</code> et <code>C++</code>, mais aussi des langages plus exotiques comme <code>Haskell</code>, <code>Julia</code> et <code>Rust</code>.</p><p>J'ai aussi eu l'occasion d'implémenter les réponses à mes solutions à l'aide du <code>TDD (Test Driven Development)</code>, ce qui m'a permis de mettre en pratique mes compétences en développement et de me concentrer particulièrement sur la qualité du code.</p><p>C'est aussi l'occasion d'implémenter mes connaissances autour des <strong>algorithmes</strong>, <strong>principes mathématiques</strong> et <strong>structures de données</strong>.</p><img src=\"https://camo.githubusercontent.com/d85c862d5a50652b8a39472cf6f45211b7f75c967a89d8cf0cdfc7acce5ac97e/68747470733a2f2f63646e2e646973636f72646170702e636f6d2f6174746163686d656e74732f3537393330333133303838363536393938342f313035363632363138363930333633343033302f696d6167652e706e67\" alt=\"Advent of Code\"><h4>Autres années</h4><p>J'ai également commencé à résoudre les problèmes pour les années précédentes et celle 2023, mais mon ordinateur portable a malheureusement <em>rendu l'âme</em> avant que je puisse terminer, me coupant dans mon élan.</p><h3>Évolution</h3><p>J'ai pour projet de partager toutes mes solutions mutualisées sur un site web permettant d'entrer ses inputs et de voir les solutions correspondantes.</p><h3>PPP - Évolution des compétences</h3><p>Participer à l'Advent of Code a été une expérience formatrice, mettant en avant ma polyvalence dans le choix des langages, de Java à Rust en passant par Haskell et Julia. La résolution quotidienne des problèmes a renforcé mes compétences algorithmiques et m'a permis d'explorer des langages moins courants.</p><p>L'implémentation des solutions avec le Test Driven Development (TDD) a souligné ma préoccupation pour la qualité du code et ma capacité à justifier son comportement. Choisir des langages variés a également renforcé ma capacité à choisir et utiliser des bibliothèques spécifiques à chaque domaine d'application.</p><p>L'intention de partager ces solutions sur un site web illustre ma compréhension des enjeux de l'économie de l'innovation numérique. Malgré les obstacles en 2023, cela a mis en lumière mes compétences en gestion de projet.</p><p>En résumé, l'Advent of Code a été un terrain d'apprentissage diversifié, illustrant une évolution substantielle dans la résolution de problèmes, le choix de langages adaptés et la gestion de projets, avec l'engagement continu envers la communauté de développement.</p>",
        "previewImg": "https://cdn.discordapp.com/attachments/814908646138970122/1193509441941798973/image.png?ex=65acf949&is=659a8449&hm=72640be9e6dc939c4748c71664b4bc34feb7da02102e8bf797e3050871b2092b&",
        "techs": [
            [
                "Java"
            ],
            [
                "Python"
            ],
            [
                "Haskell"
            ],
            [
                "C++"
            ],
            [
                "Julia"
            ],
            [
                "Rust"
            ]
        ],
        "title": "Advent of Code",
        "date": "Décembre 2022",
        "shortDesc": "Résolution de problèmes en programmation en décembre sur le modèle d'un calendrier de l'avent. Chaque jour, un nouveau langage est utilisé pour résoudre un problème différent.",
        "gitLink": "https://github.com/Eric-Philippe/Advent-Of-Code-2022"
    },
    {
        "tag": "FULLSTACK",
        "content": "<h3>Contexte</h3><p>Ce projet a été réalisé dans le cadre d'un projet scolaire, à la base en groupe, faite finalement seul.</p><h3>Objectifs</h3><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Sae-WhatsABook/master/documentation/UserCase.jpeg\" alt=\"Schéma de l'application\"><h3>Fonctionnalités</h3><p>L'application consiste d'abord à une interface utilisateur permettant de consulter les livres disponibles, de les rechercher et de les trier. Une fois connecté en tant qu'adhérent, l'utilisateur peut réserver des livres et consulter son historique d'emprunts. L'interface utilisateur permet également de présenter la librairie fictive dans son emplacement, ses horaires d'ouverture / fermerture, finalement tout ce que l'on pourrait attendre d'une librairie.</p><p>L'interface administrateur permet de gérer l'entièreté de la bibliothèque à savoir l'inventaire des livres, auteurs, catégories ... Et également une gestion précise des emprunts et réservations (annulation, retard, prolongation ...)</p><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Sae-WhatsABook/master/img/b-loans.png\" alt=\"BackOffice\"><h3>Évolution des compétences</h3><p>Ce projet scolaire a été une opportunité d'affirmer mes compétences en <code>PHP</code> et d'explorer le framework Symfony plus en profondeur, élargissant ainsi mes horizons au-delà du développement en JavaScript/TypeScript.</p><p>Ce projet a été l'occasion de pouvoir faire un site web de manière FullStack, en passant par le front (Angular), l'API-REST (Php Symfony), le Back office (Php Symfony), la base de données (MariaDB)</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/Sae-WhatsABook/master/img/f-welcome.png",
        "techs": [
            [
                "PHP"
            ],
            [
                "Symfony"
            ],
            [
                "MariaDb"
            ],
            [
                "TailwindCSS"
            ],
            [
                "Angular"
            ],
            [
                "API-REST"
            ]
        ],
        "title": "What's a Book ?",
        "date": "Février 2024",
        "shortDesc": "Ce projet est une application web complète de gestion d'une librairie, comprennant la partie utilisateur, adhérent et administrateur.",
        "gitLink": "https://github.com/Eric-Philippe/Sae-WhatsABook"
    },
    {
        "tag": "FRONTEND",
        "content": "<h3>Contexte</h3><p>Hillcrest est mon premier projet de développement web réalisé pour une <strong>\"client\"</strong>. Il s'agit d'un site de promotion pour une association proposant des séjours éducatifs dans des pays anglophones pour les lycéens. Le site a été réalisé entièrement en Vanilla <code>JS</code>, <code>HTML</code> et <code>CSS</code>, sans framework.</p><blockquote>> En fonction de son évolution et de la demande du client, le site pourrait être refait en Angular.</blockquote><h3>Fonctionnalités & Objectifs</h3><p>Le site a été réalisé dans le but de promouvoir l'association et de présenter les différents séjours proposés. On retrouve également la possibilité de pouvoir <strong>basculer entre deux langues</strong> (Français et Anglais) et de pouvoir contacter l'association via un <strong>formulaire envoyant automatiquement un mail</strong>.</p><h3>sÉvolution des compétences</h3><p>Hillcrest marque mes premiers pas dans le développement web, conçu pour promouvoir une association proposant des séjours éducatifs dans des pays anglophones pour les lycéens. Le projet a été entièrement réalisé en Vanilla JS, HTML et CSS, démontrant une capacité à créer un site complet sans l'utilisation de frameworks.</p><p>Le choix de ces technologies a permis d'acquérir une compréhension approfondie du développement front-end, soulignant la maîtrise des langages fondamentaux. L'ajout de fonctionnalités telles que la possibilité de basculer entre le français et l'anglais et un formulaire de contact avec envoi de mail a enrichi l'expérience utilisateur et démontré une application pratique des compétences acquises.</p><p>L'anticipation d'une possible refonte du site en Angular, en fonction de l'évolution et des besoins du client, s'inscrit dans une perspective d'adaptabilité et de croissance. Cela reflète la volonté d'explorer des technologies plus avancées tout en restant aligné sur les exigences futures.</p><p>En résumé, Hillcrest représente une réalisation significative dans le développement web, illustrant une compréhension approfondie des langages front-end et ouvrant la porte à une évolution vers des technologies plus avancées, en fonction des besoins du client.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/Hillcrest-Website/main/res/image.png",
        "techs": [
            [
                "HTML"
            ],
            [
                "CSS"
            ],
            [
                "JavaScript"
            ],
            [
                "emailjs"
            ],
            [
                "CI/CD"
            ]
        ],
        "title": "Hillcrest",
        "date": "Septembre 2023",
        "shortDesc": "Site de promotion pour une association proposant des séjours éducatifs dans des pays anglophones pour les lycéens.",
        "gitLink": "https://github.com/Eric-Philippe/Hillcrest-Website"
    },
    {
        "tag": "BOT",
        "content": "<h3>Contexte</h3><p>Kairos Reminder est un bot permettant de créer des rappels pour recevoir des notifications à une date et une heure précises en se basant sur l'API de Discord. Est venu plus tard la possibilité de pouvoir suivre le temps passé sur des activités personnalisées, en ayant ensuite des graphiques et un Excel automatiquement générés.</p><h4>Base de données</h4><p>Ce projet a également était une opportunité de me concentrer sur le côté Base de données, en utilisant de nombreux outils pour développer une architecture robuste et performante. On y retrouve un <code>ORM (TypeORM)</code> pour toute la gestion de la communication avec la base de données. J'ai également pu designer la base à partir de <code>MCD</code> et <code>MLD</code>, en utilisant des outils comme <em>\"Looping\"</em>.</p><h4>Modularité</h4><p>Kairos est un bot modulaire, avec une architecture complète, permettant de facilement ajouter des fonctionnalités. Chacunes de ses fonctionnalités sont indépendantes les unes des autres, et peuvent être réutilisées dans d'autres projets, étant documentées et testées.</p><p>Exemple :</p><a href=\"https://github.com/Eric-Philippe/Kairos-Bot-Reminder/blob/master/src/Book/UML_BOOK.plantuml\">UML Book</a><p><em>ou encore</em></p><a href=\"https://github.com/Eric-Philippe/Kairos-Bot-Reminder/blob/master/src/Book/UML_BOOK_COMPONENTS.plantuml\">UML Book Components</a><h3>Fonctionnalités</h3><ul><li>Création de rappels personnels</li><li>Création de rappels pour des serveurs (groupes)</li><li>Création de rappels récurrents (Journalier, Jours hors week-end, Hebdomadaire, Mensuel, Annuel...)</li><li>Gestion des différents fuseaux horaires</li><li>Tracking du temps passé sur des activités personnalisées</li><li>Différentes granularités pour l'entrée des activités (Catégorie, Activité, Tâche)</li><li>Graphiques (Chart.js) (Bar, Line, Pie, Doughnut...)</li><li>Excel automatiquement généré (xlsx)</li><li>Node.js</li></ul><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Kairos-Bot-Reminder/master/img/excel.png\" alt=\"Excel\"><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Kairos-Bot-Reminder/master/PolarAreaGraph.ex.png\" alt=\"Pie Chart\"><h3>Publication</h3><p>Kairos est mon premier Bot Discord, partagé au public. Il a été propulsé par différents sites (<em>Top.gg, Discord Bot List</em>...) et compte plus d'une <strong>centaine d'utilisateurs</strong> partout dans le monde.</p><h3>Fiabilité</h3><p>Ce bot a connu plusieurs refontes (Js à Ts ...), afin d'être le plus fiable possible pour pouvoir suggérer les rappels <strong>24/7</strong>. Cela est fait à l'aide de <code>pm2</code>, un gestionnaire de processus avancé pour les applications Node.js. On retrouve également une architecture complète semi-autonome, avec un système de logs et de gestion des erreurs, lui permettant de ne pas se bloquer en cas de problème pour continuer son processus.</p><p>Il est aussi déployé à l'aide de <code>CI/CD (GitHub Actions)</code> sur un serveur dédié, lui permettant d'être toujours à jour et de pouvoir être déployé en un clic.</p><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Kairos-Bot-Reminder/master/src/database/scripts/MCD_Img.png\" alt=\"UML\"><h4>Idées d'amélioration</h4><p>J'aimerai introduire certaines fonctionnalités à l'avenir comme par exemple pouvoir repousser un rappel !</p><h3>Installation</h3><h4>Prérequis</h4><ul><li>Node.js</li></ul><h4>Installation</h4><pre><code class=\"language-bash\">git clone https://github.com/Eric-Philippe/Kairos-Bot-Reminder.git\n\ncd Kairos-Bot-Reminder\n\nnpm install\n\nnpm start</code></pre><h3>Évolution des compétences</h3><p>Kairos Reminder, mon premier bot Discord, évolue au-delà de ses fonctions de base en offrant une panoplie de fonctionnalités utiles.</p><p>Les rappels personnels et pour des serveurs, ainsi que la possibilité de créer des rappels récurrents, démontrent la flexibilité du bot pour répondre aux divers besoins des utilisateurs. La gestion des fuseaux horaires ajoute une dimension de personnalisation pour s'adapter à une audience mondiale.</p><p>Une caractéristique distinctive est le suivi du temps passé sur des activités personnalisées, avec des graphiques générés automatiquement à l'aide de Chart.js et un fichier Excel pour une analyse plus approfondie.</p><p>Kairos a été partagé publiquement, atteignant plus d'une centaine d'utilisateurs à travers le monde grâce à sa présence sur des sites renommés tels que Top.gg et Discord Bot List.</p><p>La fiabilité du bot est assurée par des mises à niveau régulières, passant de JavaScript à TypeScript, avec une architecture robuste soutenue par pm2 pour une gestion avancée des processus Node.js. Le déploiement continu (CI/CD) à l'aide de GitHub Actions garantit que Kairos est toujours à jour, prêt à être déployé en un clic sur un serveur dédié.</p><p>Les idées d'amélioration, comme la possibilité de repousser un rappel, montrent une volonté continue d'enrichir les fonctionnalités pour offrir une expérience utilisateur encore plus complète à l'avenir.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/Kairos-Bot-Reminder/master/img/remindme.png",
        "techs": [
            [
                "TypeScript"
            ],
            [
                "PostgreSQL"
            ],
            [
                "Excel"
            ],
            [
                "CI/CD"
            ],
            [
                "Chart.js"
            ],
            [
                "PlantUML"
            ]
        ],
        "title": "Kairos Reminder",
        "date": "Juillet 2023",
        "shortDesc": "Bot pour générer des rappels et suivre le temps passé sur des activités personnalisées. Consultez les graphiques et Excel automatiquement générés.",
        "gitLink": "https://github.com/Eric-Philippe/Kairos-Bot-Reminder"
    },
    {
        "tag": "BOT",
        "content": "<h3>Contexte</h3><p>Cril Bot est un bot Discord dédié au centre des langues <em>(CRIL)</em> de <strong>l'IUT de Rangueil</strong> [Toulouse] dans un contexte d'hybridation de la formation. Ce projet a été développé à l'aide de nombreuses réunions avec les responsables du centre des langues, afin de répondre au mieux à leurs besoins.</p><h3>Fonctionnalités</h3><ul><li>Gestion des activités et coaching en ligne</li><li>Interface Google Sheets pour gérer les activités et les inscriptions</li><li>Help Desk pour les étudiants</li><li>Système d'entrée du serveur avec les dernières nouveautés de l'API Discord</li><li>Des commandes de loisir pour les étudiants et les tuteurs (Tirage au sort, Sondage, Jeux, etc.)</li><li>Cril/Place : Système de dessin collaboratif</li><li>Système de modération et d'administration du serveur</li><li>Système de logs pour les administrateurs</li></ul><p><em>Et bien plus encore...</em></p><h3>Interface communicante - Google Sheets</h3><p>Cril bot communique avec un <code>Google Sheet</code> généré automatiquement à partir d'un modèle. Ce <code>Sheet</code> offre une interface simple et efficace pour faire l'intermédiaire entre les responsables du centre des langues et le bot. Il permet de gérer les activités et les inscriptions, et de générer des rapports <strong>automatiquement</strong>.</p><img src=\"https://media.discordapp.net/attachments/579303130886569984/1196431589266161674/sheet.png?ex=65b79abf&is=65a525bf&hm=74c8ec5486fccd4ad92dd02f0dfb54ed1adf114fa0c7d4d02d7309ea558577f4&=&format=webp&quality=lossless&width=1332&height=662\" alt=\"Google Sheet\"><h3>Documentation</h3><p>La totalité de la documentation utilisateur est disponible à l'adresse suivante :</p><a href=\"https://eric-p.gitbook.io/cril-bot-documentation/\">Git Book</a><h3>Évolution des compétences</h3><p>Cril Bot, un projet déployé pour le Centre des Langues de l'IUT de Rangueil, Toulouse, démontre une évolution significative de compétences en développement, alignée avec les besoins pratiques de l'hybridation de la formation.</p><p>Le développement de Cril Bot a nécessité des interactions fréquentes avec les responsables du Centre, mettant en lumière la compétence de comprendre et de répondre aux besoins spécifiques des utilisateurs.</p><p>Les fonctionnalités mises en place, telles que la gestion des activités, le système de coaching en ligne, le Help Desk, et l'intégration avec un Google Sheet automatisé, illustrent une maîtrise des langages et des technologies (JavaScript/TypeScript, Discord API, Google Sheets API) au service de fonctionnalités concrètes et pratiques.</p><p>L'utilisation de commandes de loisir, de systèmes de dessin collaboratif, et de fonctionnalités de modération et d'administration démontre une compréhension approfondie des besoins variés du Centre des Langues.</p><p>L'évolution du bot, de la gestion des activités à l'intégration d'un Help Desk et de fonctionnalités de loisir, reflète une capacité à anticiper et à répondre de manière proactive aux exigences changeantes du projet.</p><p>En conclusion, Cril Bot représente un jalon dans le développement, passant des compétences théoriques à une application pratique et personnalisée, confirmant la capacité à créer des solutions adaptées aux besoins réels des utilisateurs.</p>",
        "previewImg": "https://cdn.discordapp.com/attachments/814908646138970122/1193510420451950602/image.png?ex=65acfa32&is=659a8532&hm=b66c1f64507a5e5994fb2aadf4ab3967c4d7ddd46a5eeeac1de8b62d03e9931f&",
        "techs": [
            [
                "TypeScript"
            ],
            [
                "PostgreSQL"
            ],
            [
                "CI/CD"
            ],
            [
                "GitBook"
            ],
            [
                "Python"
            ],
            [
                "Crontab"
            ]
        ],
        "title": "Cril Bot",
        "date": "Juillet 2023",
        "shortDesc": "Bot dédié au centre des langues de l'IUT de Rangueil. Gère et administre les activités en ligne de manière efficace sur Discord.",
        "gitLink": "https://github.com/Eric-Philippe/Cril-Bot-main"
    },
    {
        "tag": "FULLSTACK",
        "content": "<h3>Introduction</h3><p>Cette section répertorie les sous projets réalisés dans le cadre de mon <code>BUT Informatique</code> à l'IUT de Blagnac.</p><p>Ces projets ont été réalisés en groupe de 2 à 7 personnes.</p><blockquote>> ✅ À noter : Tous les projets présentés ici ont été séléctionnés parmi tous ceux proposés par la promotion, par l'équipe pédagogique de l'IUT de Blagnac pour être utilisés comme outils de manière pérenne.</blockquote><h4>Liste des projets référencés :</h4><h5>Password Generator Studies :</h5><a href=\"https://github.com/Eric-Philippe/PasswordGeneratorStudies\">GitHub</a><h5>SAE Manager :</h5><a href=\"https://github.com/Eric-Philippe/SAE-Manager---IUT-Blagnac/tree/main\">GitHub</a><h5>CaptElec :</h5><a href=\"https://github.com/Eric-Philippe/SAE-ALT-S3-Dev-22-23-CaptElec\">GitHub</a><h5>Music Manager :</h5><a href=\"https://github.com/Eric-Philippe/Basic-Music-Manager-App\">GitHub</a><h3>Password Generator Studies 🔐</h3><h4>Introduction</h4><p>Password Generator Studies est un notebook Jupyter décrivant l'étude réalisée sur les mots de passe ainsi que la génération de <em>pseudo</em> aléatoire en informatique.</p><h4>Get Started</h4><p>Afin de lance le notebook, il faut installer <code>Jupyter</code> et <code>Python</code> sur votre machine.</p><p>Une fois installé, il suffit de lancer la commande suivante :</p><pre><code class=\"language-bash\">> git clone https://github.com/Eric-Philippe/PasswordGeneratorStudies.git\n\n> pip install -r requirements.txt\n\n> jupyter notebook.\n</code></pre><h3>SAE Manager 📂</h3><h4>Introduction</h4><p>SAE Manager est une application web permettant de gérer les SAE (Situations d'Apprentissage et d'Evaluation) des étudiants de l'IUT de Blagnac.</p><p>Une SAE consiste en un gros projet à réaliser généralement sur une période d'au minimum 2/3 semaines, impliquant de nombreux moyens pour sa réalisation (humains, matériels, etc...).</p><h4>Description</h4><blockquote>> Je me suis occupé exclusivement de la partie Front-End de ce projet.</blockquote><img src=\"https://raw.githubusercontent.com/Eric-Philippe/SAE-Manager---IUT-Blagnac/main/documentation/res/img/dash-admin.png\" alt=\"Dashboard Admin\"><p>Chaque étudiant peut alors rentrer ses compétences afin de pouvoir profiter du système de création de groupes homogènes automatique.</p><img src=\"https://raw.githubusercontent.com/Eric-Philippe/SAE-Manager---IUT-Blagnac/main/documentation/res/img/skillz.png\" alt=\"Compétences\"><h4>Technologies</h4><table><tbody><tr><td>React</td></tr><tr><td>TypeScript</td></tr><tr><td>PostgreSQL</td></tr><tr><td>C#</td></tr><tr><td>Docker</td></tr><tr><td>Gherkin</td></tr></tbody></table><table><tbody></tbody></table><table><tbody></tbody></table><table><tbody></tbody></table><table><tbody></tbody></table><table><tbody></tbody></table><blockquote>> Le projet utilise Gherkin pour le BDD (Behavior Driven Development)</blockquote><hr><h3>CaptElec 🌡️</h3><h4>Introduction</h4><p>CaptElec est une application web permettant de gérer les capteurs du bâtiment de l'IUT de Blagnac. Elle permet de visualiser les données des capteurs en temps réel, par salle, par étage, et par batiment.</p><h4>Description</h4><p>Vue étage :</p><img src=\"https://raw.githubusercontent.com/rboulle/SAE-ALT-S3-Dev-22-23-CaptElec-3A-Equipe-2/master/docs/includes/images/view3.png\" alt=\"Vue Étage\"><p>Vue bâtiments :</p><img src=\"https://raw.githubusercontent.com/rboulle/SAE-ALT-S3-Dev-22-23-CaptElec-3A-Equipe-2/master/docs/includes/images/view1.png\" alt=\"Vue Bâtiments\"><p>Vue de précision :</p><img src=\"https://raw.githubusercontent.com/rboulle/SAE-ALT-S3-Dev-22-23-CaptElec-3A-Equipe-2/master/docs/includes/images/view4.png\" alt=\"Vue de précision\"><h4>Technologies</h4><p>Le côté front du site a été réalisé en <code>Angular</code> et <code>TypeScript</code>, le back en <code>Express</code> également avec <code>Typescript</code> et la Base de données en <code>PostgreSQL</code>.</p><h3>Music Manager 🎵</h3><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Basic-Music-Manager-App/main/img/welcome.png\" alt=\"Image de preview\"><h4>Introduction</h4><p>Ce projet a été réalisé dans le cadre d'un projet scolaire afin de confirmer nos compétences en <code>PHP</code> et <code>Symfony</code>.</p><p>Cela a été également l'occasion de faire du Web autrement qu'en Js/Ts, et de découvrir le framework Symfony.</p><h4>Fonctionnalités</h4><p>L'application consiste en un <code>CRUD (Create, Read, Update, Delete)</code> de chansons, avec une gestion des chanteurs. J'ai profité de l'occasion pour aiguiser mon utilisation de <code>Bootstrap</code>.</p><h3>Évolution des compétences</h3><p>Au cours de mon parcours en <strong>BUT Informatique</strong>, ma participation à divers projets collaboratifs a révélé une évolution significative de mes compétences. Dans le projet <strong>SAE Manager</strong>, en tant que responsable du Front-End, j'ai mis en œuvre des technologies telles que React, TypeScript et <code>C#</code>, démontrant ainsi ma capacité à choisir et implémenter des architectures adaptées. Le recours au <code>Behavior Driven Development (BDD)</code> avec Gherkin a illustré ma maîtrise des méthodes de développement.</p><p>Un autre projet, CaptElec, a élargi mes compétences en administration et en gestion de données. En utilisant Angular, TypeScript, Express et PostgreSQL, j'ai conçu une application permettant la gestion des capteurs du bâtiment de l'IUT, mettant en avant ma compréhension des aspects liés à la communication Front-End/Back-End et à la manipulation de données hétérogènes.</p><p>Ces expériences ont également mis en évidence des compétences non explicitement mentionnées initialement. La nécessité d'organiser une veille technologique, de guider la conduite du changement informatique et d'identifier les processus pour améliorer les systèmes d'information a émergé de manière naturelle dans la gestion collaborative de ces projets. En somme, ces réalisations témoignent d'une évolution diversifiée et approfondie de mes compétences dans le domaine informatique.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/SAE-Manager---IUT-Blagnac/main/documentation/res/img/login-page.png",
        "techs": [
            [
                "React"
            ],
            [
                "Python"
            ],
            [
                "PostgreSQL"
            ],
            [
                "Docker"
            ],
            [
                "C#"
            ],
            [
                "Gherkin"
            ]
        ],
        "title": "School Projects",
        "date": "Décembre 2023",
        "shortDesc": "Collection de projets web et Mathématiques réalisés au cours de mes années d'études. Ces projets sont réalisés en groupe et sont donc le fruit d'un travail d'équipe.",
        "gitLink": "https://github.com/Eric-Philippe/SAE-Manager---IUT-Blagnac"
    },
    {
        "tag": "TOOL",
        "content": "<h4>Introduction</h4><p>Skyblog Archiver est un outil en Python permettant d'archiver des blogs Skyrock avant leur disparition dans les limbes de l'Internet.</p><h4>Fonctionnement</h4><p>L'outil fonctionne en deux temps :</p><ul><li>Récupération des données</li><li>Génération du site statique</li></ul><p>Vous pourrez profiter de votre blog archivé en local ou le déployer sur un serveur web. La totalité du site est statique, et possède tout son style <code>CSS</code> et ses images directement.</p><h4>Get Started</h4><pre><code class=\"language-bash\">git clone https://github.com/Eric-Philippe/Skyblog_Archiver.git\n\nchmod +x archiver.sh\n\n./archiver.sh\n\n> ...\n\n> Do you want to launch a local server to see your blog ? [Y/n] Y\n\n> See your blog at http://localhost:8000 !</code></pre><blockquote>> Vous serez invité à entrer votre nom d'utilisateur et votre mot de passe Skyrock</blockquote><img src=\"https://raw.githubusercontent.com/Eric-Philippe/Skyblog_Archiver/main/res/CLI.png\" alt=\"CLI\"><h3>Évolution des compétences</h3><p>Au cours de la création de Skyblog Archiver, mes compétences en programmation ont évolué de manière significative. En abordant la récupération de données et la génération de sites statiques, j'ai renforcé mes capacités à anticiper les résultats de diverses métriques, notamment en termes de temps d'exécution. La manipulation de données hétérogènes a été mise en pratique.</p><p>De plus, l'aspect interactif de l'interface en ligne de commande témoigne de ma capacité à concevoir des applications communicantes, tout en sécurisant l'accès aux données sensibles grâce à la gestion des identifiants Skyrock. La mise à disposition d'un serveur local démontre également des compétences d'administration et de déploiement sur des serveurs web virtualisés.</p><p>En résumé, le développement de Skyblog Archiver a été une opportunité d'appliquer et d'améliorer plusieurs compétences, notamment dans la récupération et la manipulation de données, la conception d'interfaces communicantes, et le déploiement d'applications.</p>",
        "previewImg": "https://raw.githubusercontent.com/Eric-Philippe/Skyblog_Archiver/main/res/ex.png",
        "techs": [
            [
                "Python"
            ],
            [
                "HTML"
            ],
            [
                "CSS"
            ],
            [
                "Shell"
            ],
            [
                "Batch"
            ]
        ],
        "title": "SkyBlog Archiver",
        "date": "Juin 2023",
        "shortDesc": "\"SkyBlog Archiver\" - Outil en Python pour archiver des blogs Skyrock avant leur disparition dans les limbes de l'Internet",
        "gitLink": "https://github.com/Eric-Philippe/Skyblog_Archiver"
    }
]
